Repository: AdUser/xa-tags
Catalog: po/*.po
Languages: ru

source: Can't allocate memory.
ru: Не удалось выделить память.

source: Unexpected NULL pointer.
ru: Разыменование нулевого указателя.

source: realloc() failed.
ru: не удалось перераспределить память.

source: glad to meet you.
ru: приветствую

source: Sya!
ru: До встречи!

source: Parsing failed, unknown request type.
ru: Неизвестный тип запроса.

source: Parsing failed, unknown operation for this type.
ru: Неизвестная операция для этого типа запроса.

source: Parsing failed, request expected.
ru: Ожидался запрос.

source: Parsing failed, operation expected.
ru: Ожидалась операция для запроса.

source: Parsing failed, expected ':', '>' char.
ru: Ожидался символ ':' или '>'.

source: Parsing failed, data expected.
ru: Ожидались данные.

source: Malformed path
ru: Неверный путь

source: Malformed UUID
ru: Неверный UUID

source: Unallowed chars
ru: Недопустимые символы

source: Empty data, expected path
ru: Ожидался путь.

source: Empty data, expected one or more tags
ru: Ожидался один или несколько тегов.

source: No batch reqests allowed.
ru: Пакетные запросы не разрешены.

source: Request processed partly.
ru: Запрос обработан частично.

source: Request discarded.
ru: Запрос отклонён.

source: Database opened readonly. Request aborted.
ru: База открыта только для чтения. Запрос отменён.

source: Maximum search conditions reached, ignoring
ru: Достигнут максимум ключевых слов для поиска, пропущено

source: Undefined type for the search term
ru: Неизвестный тип ключевого слова в поиске

source: Search term too short, ignored
ru: Слишком короткое ключевое слово, пропущено

source: Unknown flag in this regex
ru: Неизвестный модификатор регулярного выражения

source: Regex compilation error
ru: Ошибка компиляции регулярного выражения

source: Regex support disabled, ignoring
ru: Поддержка регулярных выражений отключена, пропущено

source: Search only with regexps may be extremely slow!
ru: Поиск только регэкспами может быть очень медленным!

source: Empty search leads to empty result
ru: Нет запроса - нет ответа

source: Connection timeout.
ru: Превышено время соединения.

source: Internal error occured
ru: Произошла внутренняя ошибка.

source: $HOME variable unset, don't know where to look for database.
ru: Переменная $HOME не определена, не знаю где искать базу.

source: File updated
ru: Файл обновлён.

source: Hardlinked file, ignored
ru: Файл с жёсткими ссылками, пропущено

source: Can't open
ru: Не удалось открыть

source: xattrs disabled or not supported
ru: расширенные аттрибуты отключены или не поддерживаются

source: Created new database
ru: Создана новая база.

source: Failed to open database
ru: Не удалось открыть базу

source: Failed to close database
ru: Не удалось закрыть базу

source: Failed to init database
ru: Не удалось создать базу

source: Failed to prepare statement
ru: Не удалось подготовить запрос

source: Failed to exec statement
ru: Не удалось выполнить запрос

source: Malformed or incorrect data on input
ru: Повреждённые или неверные данные на входе

source: Successfull insert, but zero uuid returned
ru: Успешное добавление в базу, но возвращён нулевой идентификатор.

source: No such uuid
ru: Не найден запрошенный UUID

source: failed to determine db version
ru: не удалось определить версию базы

source: Database version mismatch. Expected version
ru: Несовпадение версии базы. Ожидаемая версия
